[
    {
        "id": 1,
        "company": "Cognizant – Ace Hardware",
        "position": "Associate",
        "duration": "Oct 2024 - Present",
        "location": "Chennai",
        "description": "Spearheading the integration of advanced Order Management Systems (OMS) to optimize fulfillment workflows.",
        "responsibilities": [
            "Architected and deployed automated OMS workflows, reducing manual intervention by 40% and accelerating order processing times across high-volume transaction channels.",
            "Engineered robust API integrations between KIBO Commerce and third-party logistics providers, ensuring real-time inventory synchronization and shipment tracking.",
            "Led the development of the 'Yard-Rx' geolocation module, implementing precise store-level inventory mapping to streamline curbside pickup operations.",
            "Optimized checkout performance by refactoring legacy code, resulting in a 15% decrease in cart abandonment rates through improved load times and error handling.",
            "Collaborated with cross-functional teams to design scalable data models for returns and cancellations, enhancing post-purchase user experience."
        ],
        "technologies": [
            "React",
            "Redux Toolkit",
            "KIBO OMS",
            "RESTful APIs",
            "Node.js"
        ]
    },
    {
        "id": 2,
        "company": "Cognizant – Ace Hardware",
        "position": "Program Analyst",
        "duration": "Aug 2023 - Sep 2024",
        "location": "Chennai",
        "description": "Developed enterprise-grade UI components and accessible interfaces for e-commerce platforms.",
        "responsibilities": [
            "Developed a comprehensive library of reusable React components, enforcing strict accessibility (WCAG 2.1) standards and reducing UI inconsistencies across 5+ internal applications.",
            "Implemented a dynamic Store Locator feature using Google Maps API and spatial data, driving a 20% increase in 'Buy Online, Pick Up In-Store' (BOPIS) orders.",
            "Enhanced the Product Detail Page (PDP) architecture to support complex product variations and bundling, significantly improving the merchandising capabilities.",
            "Integrated real-time notification systems for order status updates, providing customers with transparent and immediate feedback throughout the fulfillment lifecycle.",
            "Mentored junior developers on React best practices, code reviews, and state management strategies using Context API."
        ],
        "technologies": [
            "React",
            "TypeScript",
            "Material UI",
            "Google Maps API",
            "Jest"
        ]
    },
    {
        "id": 3,
        "company": "Cognizant – Ace Hardware",
        "position": "Program Analyst Trainee",
        "duration": "Aug 2022 - Aug 2023",
        "location": "Chennai",
        "description": "Executed the strategic migration of legacy frontend systems to modern React architectures.",
        "responsibilities": [
            "Successfully migrated critical legacy modules from Backbone.js to a modern React.js architecture, improving application performance and developer velocity.",
            "Designed and documented an interactive Component System in Storybook, facilitating rapid prototyping and ensuring design system compliance.",
            "Implemented responsive design principles across the Account Dashboard, resulting in a seamless mobile experience for over 50,000 active users.",
            "Assisted in the implementation of dynamic subscription management features, allowing customers to easily modify recursion frequencies and payment methods."
        ],
        "technologies": [
            "React",
            "JavaScript (ES6+)",
            "Backbone.js",
            "Storybook",
            "SCSS"
        ]
    },
    {
        "id": 4,
        "company": "Room Cleaning Service",
        "position": "Frontend Trainee",
        "duration": "Jan 2022 - Apr 2022",
        "location": "Remote",
        "description": "Built and deployed a responsive service booking platform from the ground up.",
        "responsibilities": [
            "Designed and developed a fully responsive service booking interface using HTML5, CSS3, and Bootstrap, ensuring cross-browser compatibility.",
            "Implemented client-side form validation and dynamic pricing calculators using JavaScript and jQuery to enhance user interaction.",
            "Optimized front-end assets and code structure, achieving a Google Lighthouse performance score of 95+.",
            "Collaborated with backend developers to integrate booking APIs and ensure secure data transmission."
        ],
        "technologies": [
            "HTML5",
            "CSS3",
            "JavaScript",
            "jQuery",
            "Bootstrap"
        ]
    }
]